Hootie81/STC3117/stc3117_Driver.c
/******************** (C) COPYRIGHT 2011 STMicroelectronics ********************
* File Name          : stc3117_Driver.c
* Author             : AMS - IMS application, C.Huitema updated from 3115 to suit 3117
* Version            : V01
* Date               : 10 October 2014, updated 17 June 2016
* Description        : STC3117 driver source code
********************************************************************************
* THE PRESENT SOFTWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
* WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE TIME.
* AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY DIRECT,
* INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING FROM THE
* CONTENT OF SUCH SOFTWARE AND/OR THE USE MADE BY CUSTOMERS OF THE CODING
* INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.

* THIS SOURCE CODE IS PROTECTED BY A LICENSE.
* FOR MORE INFORMATION PLEASE CAREFULLY READ THE LICENSE AGREEMENT FILE LOCATED
* IN THE ROOT DIRECTORY OF THIS FIRMWARE PACKAGE.
*******************************************************************************/

/* Includes ------------------------------------------------------------------*/
#include "stc3117_Driver.h" 
#include "stc3117_Battery.h"
#include "stc3117_I2C.h" 

/*
  ===============================================================================
                   ##### STC3117 driver description #####
  ===============================================================================

	This driver is dedicated to STC3117 battery monitoring IC management, it allows
	the stc3117 to be configured, and used without external software.
	
	++ stc3117_Driver.c file contains the functions to initialize and report the 
			battery state based on STC3117 algorithms.
		- Driver contains its own I2C access functions, they have to be linked with 
			I2C driver interface  functions. HW system have to support multi I2C access 
			commands to guaranty the data integrity during the 16 bits register R/W 
			operations.
		- First part of the driver is composed by driver own functions, which should 
			not be accessed by external functions.
		- Then the GasGauge functions are the main interface functions which have to 
			be used by the application to initialize, monitor and stop the STC3117 
			device.
		- Power saving functions can be used to manage the STC3117 operating mode 
			(mixed mode or Voltage mode). These two functions have to be called by 
			external program to switch the STC3117 operating mode after STC3117 
			initialization.
		- Alarm management functions have to be called to set, stop, get, clear and
			change alarm thresholds after STC3117 initialization.
		- The relaxation register can also be updated after initialization thanks to 
			the STC3117_RelxTmrSet.
	
	++ stc3117_Driver.h file defines the STC3117 static numbers, driver API 
			structures and driver API functions.	
		- STC3117_BatteryData_TypeDef is filled by the driver with battery state.
		- STC3117_ConfigData_TypeDef is filled by the driver with battery 
			configuration data from stc3117_Battery.h
		- RAMData is the RAM memory map description, used internally of the driver.
			Have no to be modified by external accesses.
	
	++ stc3117_Battery.h file is used to describe the battery and application 
			configurations.
	
	++ stc3117_I2C.c file is used to interface STC3117 driver I2C functions with 
		application I2C functions.
		
	++ stc3117_I2C.h file contains the stc3117_I2C.c function declarations.

  ===============================================================================
                    ##### How to use STC3117 driver #####
  ===============================================================================

	++ 	Update 	I2C_Write and I2C_Read functions with application I2C driver functions 
		in stc3117_I2C.C file.
							
	++	Initialize STC3117 dedicated hardware externally of the driver (I2C 
			interface, GPIOs...)			
	
	++	Fill STC3117_Battery.h with battery and application parameters
	
	++  Call one time the the GasGauge_Initialization function
	
			Parameters:
				- STC3117_ConfigData_TypeDef parameter is filled with STC3117_Battery.h 
					data by the driver
				- STC3117_BatteryData_TypeDef parameter is filled with STC3117 algorithm 
					results and returns the battery state to application
				
			Function description:
				- Initialize SW structures
				- Check battery history: new battery, swapped battery, already connected 
					battery
				- Initializes STC3117 registers accordingly to battery history
				- Initializes STC3117 RAM memory accordingly to battery history
			
			Returns:
				- (-1) is returned when STC3117 cannot be accessed: I2C bus is not 
					properly configured or STC3117 is not power supplied
				- (0) is returned if initialization succeeds.
			
	++ Call the GasGauge_Task function when battery information is needed: 
			every 1 to 30 seconds (no frequency accuracy needed)
		
			Parameters:
				- STC3117_ConfigData_TypeDef parameter is used in case of STC3117 has to be 
					initialized again
				- STC3117_BatteryData_TypeDef parameter is filled with STC3117 algorithm 
					results and returns the battery state to application
				
			Function description:
				- Check STC3117, battery and application state
				- if battery is well present battery data are updated
				- Available battery state information are returned
			
			Returns:
				- (-1) is returned when STC3117 cannot be accessed (I2C bus is busy or 
					STC3117 is not power supplied) or when BATD/CD pin is in high level state.
				- (0) is returned if only battery SOC,Voltage and OCV data are available
				- (1) is returned if every STC3117_BatteryData_TypeDef data are available.
				
	++ call the GasGauge_Stop function during the application switch off sequence
		 This will stop the STC3117 and save energy. This will help to recover the
		 battery context during the next GasGauge_Initialization function.
				
	++ GasGauge_Reset function has not to be used by default.
		 This function has to be called only in abnormal use cases.
				- (-1) is returned when STC3117 cannot be stopped
				- (0) is returned if reset operation succeeds
				
*/


/* ---- STC3117 I2C R/W interface --------------------------------------------- */

