Hootie81/STC3117/stc3117_Driver.c
/*******************************************************************************
* Function Name  : STC3117_ReadByte
* Description    : utility function to read the value stored in one register
* Input          : RegAddress: STC3117 register,
* Return         : 8-bit value, or 0 if error
*******************************************************************************/
static int STC3117_ReadByte(int RegAddress)
{
  int value;
  unsigned char data[2];
  int res;

  res = I2C_Read(1, RegAddress , data);
	
  if (res >= 0)
  {
    /* no error */
    value = data[0];
  }
  else
    value=-1;

  return(value);
}



/*******************************************************************************
* Function Name  : STC3117_WriteByte
* Description    : utility function to write a 8-bit value into a register
* Input          : RegAddress: STC3117 register, Value: 8-bit value to write
* Return         : error status (STC3117_OK, !STC3117_OK)
*******************************************************************************/
static int STC3117_WriteByte(int RegAddress, unsigned char Value)
{
  int res;
  unsigned char data[2];

  data[0]= Value;
  res = I2C_Write(1, RegAddress , data);
	
  return(res);

}


/*******************************************************************************
* Function Name  : STC3117_ReadWord
* Description    : utility function to read the value stored in one register pair
* Input          : RegAddress: STC3117 register,
* Return         : 16-bit value, or 0 if error
*******************************************************************************/
static int STC3117_ReadWord(int RegAddress)
{
  int value;
  unsigned char data[2];
  int res;

  res = I2C_Read(2, RegAddress , data);
  
  if (res >= 0)
  {
    /* no error */
    value = data[1];
    value = (value <<8) | data[0];
  }
  else
    value=-1;

  return(value);
}

int STC3117_ReadUnsignedWord(unsigned short RegAddress, unsigned short * RegData)
{
  unsigned short data16;
  unsigned char data8[2];
  int status;

  status = I2C_Read(2, RegAddress , data8);
  
  if (status >= 0)
  {
    /* no error */
    data16 = data8[1];
    data16 = (data16 <<8) | data8[0];
    *RegData = data16;
  }
  else
    status = -1;

  return(status);
}

/*******************************************************************************
* Function Name  : STC3117_WriteWord
* Description    : utility function to write a 16-bit value into a register pair
* Input          : RegAddress: STC3117 register, Value: 16-bit value to write
* Return         : error status (STC3117_OK, !STC3117_OK)
*******************************************************************************/
static int STC3117_WriteWord(int RegAddress, int Value)
{
  int res;
  unsigned char data[2];

  data[0]= Value & 0xff; 
  data[1]= (Value>>8) & 0xff;
  
  res = I2C_Write(2, RegAddress , data);
	
  return(res);

}

/*******************************************************************************
* Function Name  : STC3117_ReadWord
* Description    : utility function to read the value stored in one register pair
* Input          : RegAddress: STC3117 register, nbr: number of bytes to read
* Return         : 16-bit value, or 0 if error
*******************************************************************************/
static int STC3117_ReadBytes(unsigned char *data,int RegAddress,int nbr)
{
  int res;

  res = I2C_Read(nbr, RegAddress , data);
  
  return(res);
}


/*******************************************************************************
* Function Name  : STC3117_WriteWord
* Description    : utility function to write a 16-bit value into a register pair
* Input          : RegAddress: STC3117 register, Value: 16-bit value to write, nbr: number of bytes to write
* Return         : error status (STC3117_OK, !STC3117_OK)
*******************************************************************************/
static int STC3117_WriteBytes(unsigned char *data,int RegAddress,int nbr)
{
  int res;

  res = I2C_Write(nbr, RegAddress , data);
	
  return(res);
}

/* ---- End of I2C R/W interface --------------------------------------------- */


/* ---- Internal functions --------------------------------------------------- */

/*******************************************************************************
* Function Name  : STC3117_GetStatusWord
* Description    :  Read the STC3117 status
* Input          : None
* Return         : status word (16bit: REG_MODE and REG_CTRL), -1 if error
*******************************************************************************/
static int STC3117_GetStatusWord(void)
{
  int value;

  /* first, check the presence of the STC3117 by reading first byte of dev. ID */
  if (STC3117_ReadByte(STC3117_REG_ID)!= STC3117_ID) return (-1);

  /* read REG_MODE and REG_CTRL */
  value = STC3117_ReadWord(STC3117_REG_MODE);
  value &= 0x7fff;   //(MSbit is unused, but used for error dectection here)

  return (value);
}


/*******************************************************************************
* Function Name  : STC3117_CheckI2cDeviceId
* Description    :  Read the hardcoded STC3117 ID number
* Input          : pointer to char
* Return         : status, -1 if error, -2 if bad ID
*******************************************************************************/
int STC3117_CheckI2cDeviceId(void)
{
  unsigned char RegAddress;
  unsigned char data8;
  int status;

  RegAddress = STC3117_REG_ID;
  status = I2C_Read(1, RegAddress , &data8);

  if (status >= 0)
  {
	  if(data8 == STC3117_ID)
	  {
		  status = 0; //OK
	  }
	  else
	  {
		  status = -2; //I2C is working, but the ID doesn't match.
	  }
  }
  else
  {
	  status = -1; // I2C error
  }

  return(status);
}

/*******************************************************************************
* Function Name  : STC3117_GetRunningCounter
* Description    :  Get the STC3117 Convertion counter value
* Input          : None
* Return         : status word (REG_COUNTER), -1 if error
*******************************************************************************/
int STC3117_GetRunningCounter(void)
{
  unsigned short value;
  int status;

