Hootie81/STC3117/stc3117_Driver.c
  /* read STC3117_REG_COUNTER */
  status = STC3117_ReadUnsignedWord(STC3117_REG_COUNTER, &value);

  if(status < 0) //error
	  value = -1;

  return ((int)value);
}

/*******************************************************************************
* Function Name  : STC3117_SetParamAndRun
* Description    :  initialize the STC3117 parameters and Start the device to monitor the battery
* Input          : rst: init algo param
* Return         : 0
*******************************************************************************/
static void STC3117_SetParamAndRun(STC3117_ConfigData_TypeDef *ConfigData)
{
  int value;
  
  /* set GG_RUN=0 before changing algo parameters */
  STC3117_WriteByte(STC3117_REG_MODE,STC3117_VMODE);
  
  /* init OCV curve */
	STC3117_WriteBytes((unsigned char*) ConfigData->OCVOffset, STC3117_REG_OCVTAB, STC3117_OCVTAB_SIZE);
  
  /* set alm level if different from default */
  if (ConfigData->Alm_SOC !=0 )   
     STC3117_WriteByte(STC3117_REG_ALARM_SOC,ConfigData->Alm_SOC*2); 
  if (ConfigData->Alm_Vbat !=0 ) 
  {
    value= ((long)(ConfigData->Alm_Vbat << 9) / VoltageFactor); /* LSB=8*2.2mV */
    STC3117_WriteByte(STC3117_REG_ALARM_VOLTAGE, value);
  }
    
  /* relaxation timer */
  if (ConfigData->Rsense !=0 )  
  {
    value= ((long)(ConfigData->RelaxCurrent << 9) / (CurrentFactor / ConfigData->Rsense));   /* LSB=8*5.88uV */
    STC3117_WriteByte(STC3117_REG_CURRENT_THRES,value); 
  }
  
  /* set parameters if different from default, only if a restart is done (battery change) */
  if (RAMData.reg.CC_cnf !=0 ) STC3117_WriteWord(STC3117_REG_CC_CNF,RAMData.reg.CC_cnf); 
  if (RAMData.reg.VM_cnf !=0 ) STC3117_WriteWord(STC3117_REG_VM_CNF,RAMData.reg.VM_cnf); 

  STC3117_WriteByte(STC3117_REG_CTRL,0x03);  /*   clear PORDET, BATFAIL, free ALM pin, reset conv counter */
  STC3117_WriteByte(STC3117_REG_MODE, STC3117_GG_RUN | (STC3117_VMODE * ConfigData->Vmode) | (STC3117_ALM_ENA * ALM_EN));  /*   set GG_RUN=1, set mode, set alm enable */
 
}  




/*******************************************************************************
* Function Name  : STC3117_Startup
* Description    :  initialize and start the STC3117 at application startup
* Input          : None
* Return         : 0 if ok, -1 if error
*******************************************************************************/
static int STC3117_Startup(STC3117_ConfigData_TypeDef *ConfigData)
{
  int res;
  int ocv;
  
  /* check STC31xx status */
  res = STC3117_GetStatusWord();
  if (res<0) return(res);

  /* read OCV */
  ocv=STC3117_ReadWord(STC3117_REG_OCV);

  STC3117_SetParamAndRun(ConfigData);  /* set STC3117 parameters and run it  */
  
  /* rewrite ocv to start SOC with updated OCV curve */
  STC3117_WriteWord(STC3117_REG_OCV,ocv);
  
  return(0);
}


/*******************************************************************************
* Function Name  : STC3117_Restore
* Description    :  Restore STC3117 previous good state from values stored in internal 16byte RAM
* Input          : None
* Return         : 
*******************************************************************************/
static int STC3117_Restore(STC3117_ConfigData_TypeDef *ConfigData)
{
  int res;

  /* check STC31xx status */
  res = STC3117_GetStatusWord();
  if (res<0) return(res);
 
  STC3117_SetParamAndRun(ConfigData);  /* set STC3117 parameters and run it  */

  /* restore last SOC from STC3117 embedded RAM data for better accuracy */
  // Note: The latest SOC is saved every time GasGauge_Task() is called (i.e every 5s).
  STC3117_WriteWord(STC3117_REG_SOC,RAMData.reg.HRSOC); //force a new SoC to the fuel gauge

  return(0);
}




/*******************************************************************************
* Function Name  : STC3117_Powerdown
* Description    :  stop the STC3117 at application power down (i.e Standby mode with RAM content retention)
* Input          : None
* Return         : error status (STC3117_OK, !STC3117_OK)
*******************************************************************************/
static int STC3117_Powerdown(void)
{
  int res;
  
  /* write 0x01 into the REG_CTRL to release IO0 pin open, */
  STC3117_WriteByte(STC3117_REG_CTRL, 0x01);

  /* write 0 into the REG_MODE register to put the STC3117 in standby mode */
   res = STC3117_WriteByte(STC3117_REG_MODE, 0);
   if (res!= STC3117_OK) return (res);

   return (STC3117_OK);
}




/*******************************************************************************
* Function Name  : STC3117_conv
* Description    : conversion utility 
*  convert a raw 16-bit value from STC3117 registers into user units (mA, mAh, mV, °C)
*  (optimized routine for efficient operation on 8-bit processors such as STM8)
* Input          : value, factor
* Return         : result = value * factor / 4096
*******************************************************************************/
static int STC3117_conv(short value, unsigned short factor)
{
  int v;
  
  v= ( (long) value * factor ) >> 11;
  v= (v+1)/2;
  
  return (v);
}

/*******************************************************************************
* Function Name  : STC3117_ReadBatteryData
* Description    :  utility function to read the battery data from STC3117
*                  to be called every 5s or so
* Input          : ref to BatteryData structure
* Return         : error status (STC3117_OK, !STC3117_OK)
*******************************************************************************/
static int STC3117_ReadBatteryData(STC3117_BatteryData_TypeDef *BatteryData)
{
  unsigned char data[16];
  int res;
  int value;


  /* read STC3117 registers 0 to 14 */
	res = STC3117_ReadBytes(data, 0, 15);
	
  if (res<0) return(res);  /* read failed */
	
  /* fill the battery status data */
  /* SOC */
  value=data[3]; value = (value<<8) + data[2];
  BatteryData->HRSOC = value;     /* result in 1/512% */
  BatteryData->SOC = (value * 10 + 256) / 512; /* result in 0.1% */

  /* conversion counter */
  value=data[5]; value = (value<<8) + data[4];
  BatteryData->ConvCounter = value;

  /* current */
  value=data[7]; value = (value<<8) + data[6];
  value &= 0x3fff;   /* mask unused bits */
  if (value>=0x2000) value = value - 0x4000;  /* convert to signed value */
  BatteryData->Current = STC3117_conv(value, CurrentFactor/RSENSE);  /* result in mA */

