Hootie81/STC3117/stc3117_Driver.c
  /* voltage */
  value=data[9]; value = (value<<8) + data[8];
  value &= 0x0fff; /* mask unused bits */
  if (value>=0x0800) value -= 0x1000;  /* convert to signed value */
  value = STC3117_conv(value,VoltageFactor);  /* result in mV */
  BatteryData->Voltage = value;  /* result in mV */

  /* temperature */
  value=data[10]; 
  if (value>=0x80) value -= 0x100;  /* convert to signed value */
  BatteryData->Temperature = value*10;  /* result in 0.1°C */

  /* OCV */
  value=data[14]; value = (value<<8) + data[13];
  value &= 0x3fff; /* mask unused bits */
  if (value>=0x02000) value -= 0x4000;  /* convert to signed value */
  value = STC3117_conv(value,VoltageFactor);  
  value = (value+2) / 4;  /* divide by 4 with rounding */
  BatteryData->OCV = value;  /* result in mV */
  
//  res=STC3117_Read(1, STC3117_REG_RELAX_COUNT, data);
//  if (res<0) return(res);  /* read failed */
//  BatteryData->RelaxTimer = data[0];

  
  return(STC3117_OK);
}


/*******************************************************************************
* Function Name  : STC3117_ReadRamData
* Description    : utility function to read the internal RAM data from STC3117
* Input          : ref to RAM data array
* Return         : error status (STC3117_OK, !STC3117_OK)
*******************************************************************************/
static int STC3117_ReadRamData(unsigned char *RamData)
{
	return STC3117_ReadBytes(RamData, STC3117_REG_RAM, STC3117_RAM_SIZE);
}

/*******************************************************************************
* Function Name  : STC3117_WriteRamData
* Description    : utility function to write the RAM data into STC3117
* Input          : ref to RAM data array
* Return         : error status (STC3117_OK, !STC3117_OK)
*******************************************************************************/
static int STC3117_WriteRamData(unsigned char *RamData)
{
	return STC3117_WriteBytes(RamData, STC3117_REG_RAM, STC3117_RAM_SIZE);
}

/*******************************************************************************
* Function Name  : STC3117_CalcRamCRC8
* Description    : calculate the CRC8
* Input          : data: pointer to byte array, n: number of vytes
* Return         : CRC calue
*******************************************************************************/
static int STC3117_CalcRamCRC8(unsigned char *data, int n)
{
  int crc=0;   /* initial value */
  int i, j;

  for (i=0;i<n;i++)
  {
    crc ^= data[i];
    for (j=0;j<8;j++) 
    {
      crc <<= 1;
      if (crc & 0x100)  crc ^= 7;
    }
  }
  return(crc & 255);

}

/*******************************************************************************
* Function Name  : STC3117_UpdateRamCRC
* Description    : calculate the RAM CRC
* Input          : none
* Return         : CRC value
*******************************************************************************/
static int STC3117_UpdateRamCRC(void)
{
  int res;
  
  res=STC3117_CalcRamCRC8(RAMData.db,STC3117_RAM_SIZE-1);
  RAMData.db[STC3117_RAM_SIZE-1] = res;   /* last byte holds the CRC */
  return(res);
}

/*******************************************************************************
* Function Name  : STC3117_InitRamData
* Description    : Init the STC3117 RAM registers with valid test word and CRC
* Input          : STC3117_ConfigData_TypeDef structure
* Return         : none
*******************************************************************************/
static void STC3117_InitRamData(STC3117_ConfigData_TypeDef *ConfigData)
{
  int index;

  //Set full RAM tab to 0
  for (index=0;index<STC3117_RAM_SIZE;index++) 
    RAMData.db[index]=0;
  
  //Fill RAM regs
  RAMData.reg.TestWord=RAM_TESTWORD;  /* Fixed word to check RAM integrity */
  RAMData.reg.CC_cnf = ConfigData->CC_cnf;
  RAMData.reg.VM_cnf = ConfigData->VM_cnf;
  
  /* update the crc */
  STC3117_UpdateRamCRC();
}

/* ---- End of Internal functions --------------------------------------------------- */

/* ---- Driver interface functions -------------------------------------------------- */


/*******************************************************************************
* Function Name  : STC3117_Initialization
* Description    : Start the STC3117 battery tracking algorithm system
* Input          : also parameters in stc3117_Battery.h file
* Return         : 0 is ok, -1 if STC3117 not found or I2C error
* Affect         : Initializes ConfigData and returns battery early status in BatteryData
*******************************************************************************/
int GasGauge_Initialization(STC3117_ConfigData_TypeDef *ConfigData, STC3117_BatteryData_TypeDef *BatteryData)
{
  int res, loop;
  int OCVOffset[32] = OCV_OFFSET_TAB;
  int SOCOffset[16] = SOC_OFFSET_TAB;
  /*** Fill configuration structure parameters ***/
  
  ConfigData->Vmode = VMODE;

  if(RSENSE!=0)	ConfigData->Rsense = RSENSE;
  else ConfigData->Rsense = 10; // default value to avoid division by 0
  
  ConfigData->CC_cnf = (BATT_CAPACITY * ConfigData->Rsense * 250 + 6194) / 12389;
	
  if(BATT_RINT!=0)	ConfigData->VM_cnf = (BATT_CAPACITY * BATT_RINT * 50 + 24444) / 48889;
  else ConfigData->VM_cnf = (BATT_CAPACITY * 200 * 50 + 24444) / 48889; // default value

  for(loop=0; loop<32; loop++)
  {
	if(OCVOffset[loop] > 127) OCVOffset[loop] = 127;
	if(OCVOffset[loop] < -127) OCVOffset[loop] = -127;
	 ConfigData->OCVOffset[loop] = OCVOffset[loop];
  }
  for(loop=0; loop<16; loop++)
  {
	if(SOCOffset[loop] > 127) SOCOffset[loop] = 127;
	if(SOCOffset[loop] < -127) SOCOffset[loop] = -127;
	 ConfigData->SOCOffset[loop] = SOCOffset[loop];
  }
  
  ConfigData->Cnom = BATT_CAPACITY; 
  ConfigData->RelaxCurrent = BATT_CAPACITY / 20;
  
  ConfigData->Alm_SOC = ALM_SOC;
  ConfigData->Alm_Vbat = ALM_VBAT;
  
  
  /*** Initialize Gas Gauge system ***/ 
  
  /*Battery presence status init*/
  BatteryData->Presence = 1;

  /* check RAM data validity */ 
  //refer to AN4324, Figure 16: STC3115 initialization type selection flowchart
  {
	// ** Internal RAM purpose: **
	// The STC3115 device embeds a 16-byte RAM memory area.
	// The registers of this area can be used to periodically save the battery status. 
	// This allows battery information to be recovered when the application is stopped but the battery is not unplugged.
	//
	// Typical use case of STC3115 Restoration is:
	// User Platform power down (but stc3115 set in standby mode), no battery removal, and then Platform power up (stc3115 set in running mode). So Battery state context can be restored. 
	// If the battery is removed or in case of soft reset (STC3115 soft reset), RAM content is reset, the SOC tracking will restart from zero (not use the RAM content). So there is no restoration in this condition.

