Hootie81/STC3117/stc3117_Driver.c
	  STC3117_ReadRamData(RAMData.db);
 
	  if ( (RAMData.reg.TestWord != RAM_TESTWORD) || (STC3117_CalcRamCRC8(RAMData.db,STC3117_RAM_SIZE)!=0) ) //RAM invalid
	  {
		// RAM is empty (Fuel gauge first power-up)
		// or RAM not yet initialized by this Driver (no TESTWORD)
		// or RAM corrupted (bad CRC)
		// => Full initialisation:  STC3115 init + RAM init
		//    e.g. New battery plugged-in, using the initial battery model.
		
		STC3117_InitRamData(ConfigData);
		res=STC3117_Startup(ConfigData);  /* return -1 if I2C error or STC3117 not present */
	  }
	  else //RAM valid (i.e initialization process started again, battery has not been removed)
	  {
		  /* check STC3117 status */
		  if ( (STC3117_ReadByte(STC3117_REG_CTRL) & (STC3117_BATFAIL | STC3117_PORDET)) != 0 )
		  {
				//PORDET detected (Power On Reset occurred after Device powered-On or a Soft-reset)
				//or Error occured: BATFAIL (battery disconnected or Undervoltage UVLO)
				// => Standard initialisation: STC3117 init (without RAM init)
			    //    e.g. Battery has not been removed, but restoration from internal RAM not possible

				res=STC3117_Startup(ConfigData);  /* return -1 if I2C error or STC3117 not present */
		  }
		  else //Restoration OK, The battery has not been removed since the last application switch off. (no specific event occured, restore the latest good SoC value for better accuracy)
		  {
				res=STC3117_Restore(ConfigData); /* recover from last SOC */
		  }
	  }
  }

	//Update RAM state flag to INIT state
	{
		RAMData.reg.STC3117_State = STC3117_INIT;
		STC3117_UpdateRamCRC();
		STC3117_WriteRamData(RAMData.db);
	}
  
  return(res);    /* return -1 if I2C error or STC3117 not present */
}

/*******************************************************************************
* Function Name  : GasGauge_Reset
* Description    : Reset the Gas Gauge system, this function must not be used frequently
* Input          : None
* Return         : 0 is ok, -1 if I2C error
*******************************************************************************/
int GasGauge_Reset(void)  
{
  int res;

  /* reset RAM */
  RAMData.reg.TestWord=0;  
  RAMData.reg.STC3117_State = STC3117_UNINIT;
  res = STC3117_WriteRamData(RAMData.db);
  if(res != STC3117_OK) return res;
  
  /* reset STC3117*/
  res = STC3117_WriteByte(STC3117_REG_CTRL, STC3117_PORDET);  /*   set Soft Reset */

  return res;
}



/*******************************************************************************
* Function Name  : GasGauge_Stop
* Description    : Stop the Gas Gauge system and save the context in STC3117 RAM
* Input          : None
* Return         : 0 is ok, -1 if I2C error
*******************************************************************************/
int GasGauge_Stop(void)
{
  int res;
  
  /*Save context in RAM*/
  STC3117_ReadRamData(RAMData.db);
  RAMData.reg.STC3117_State= STC3117_POWERDN;
  
  /* update the crc */
  STC3117_UpdateRamCRC();
  STC3117_WriteRamData(RAMData.db);
   
  /*STC3117 Power down (ie Standby mode with RAM content retention))*/
  res=STC3117_Powerdown();
  if (res!=0) return (-1);  /* error */

  return(0);  
}



/*******************************************************************************
* Function Name  : GasGauge_Task
* Description    : Periodic Gas Gauge task, to be called periodically (every 1 to 60 seconds)
* Input          : STC3117 ConfigData structure filled by GasGauge_Initialization function
* Return         : 1 if data available, 0 if no data, -1 if error
* Affect         : Fill the BatteryData structure with updated battery status
*******************************************************************************/
int GasGauge_Task(STC3117_ConfigData_TypeDef *ConfigData,STC3117_BatteryData_TypeDef *BatteryData)
{
  int res;

  /* ----------------------------- System state verification ---------------------------- */
  /*Read STC3117 status registers */
  res=STC3117_GetStatusWord();

  if (res<0) return(res);  /* return if I2C error or STC3117 not responding */  
  BatteryData->StatusWord = res;
  
  /* check STC3117 RAM status (battery has not been changed) */
  STC3117_ReadRamData(RAMData.db);
  if ( (RAMData.reg.TestWord!= RAM_TESTWORD) || (STC3117_CalcRamCRC8(RAMData.db,STC3117_RAM_SIZE)!=0) )
  {
    /* if RAM non ok, reset it and set init state */
    STC3117_InitRamData(ConfigData); 
    RAMData.reg.STC3117_State = STC3117_INIT;
  }  
  
  /* check battery presence status */
  if ((BatteryData->StatusWord & ((int)STC3117_BATFAIL<<8)) != 0)
  {
    /*Battery disconnection has been detected			*/
		
	/*BATD pin level is over 1.61 or Vcc is below 2.7V	*/
	BatteryData->Presence = 0;
	
	/*HW and SW state machine reset*/
    GasGauge_Reset();

    return (-1);
  }
	
  /* check STC3117 running mode*/
  if ((BatteryData->StatusWord & STC3117_GG_RUN) == 0) //Gas gauge no more running (in Standby mode)
  {
		if( (RAMData.reg.STC3117_State == STC3117_RUNNING) ||
			(RAMData.reg.STC3117_State == STC3117_POWERDN)
			)
		{
			STC3117_Restore(ConfigData);  /* if RUNNING state, restore STC3117 with latest good SoC value for better accuracy */
		}
		else
		{
			STC3117_Startup(ConfigData);  /* if INIT state, initialize STC3117*/
		}
		
    RAMData.reg.STC3117_State = STC3117_INIT;
  }
  
  /* --------------------------------- Read battery data ------------------------------- */

  res=STC3117_ReadBatteryData(BatteryData);  
  if (res!=0) return(-1); /* abort in case of I2C failure */
  
  
  /* ------------------------------- battery data report ------------------------------- */
  /* check INIT state */
  if (RAMData.reg.STC3117_State == STC3117_INIT)
  {
    /* INIT state, wait for current & temperature value available: */
    if (BatteryData->ConvCounter > VCOUNT) 
    {
        RAMData.reg.STC3117_State = STC3117_RUNNING;
		/*Battery is connected*/
		BatteryData->Presence = 1;
    }
  }

  if (RAMData.reg.STC3117_State != STC3117_RUNNING) /* not running : data partially available*/
  {
  	BatteryData->ChargeValue = ConfigData->Cnom * BatteryData->SOC / MAX_SOC;
    BatteryData->Current=0;
	BatteryData->Temperature=250;
    BatteryData->RemTime = -1;
  }
  else /* STC3117 running */
  {
  
	/* ---------- process SW algorithms -------- */
		
	/* early empty compensation */
	if (BatteryData->Voltage < APP_CUTOFF_VOLTAGE)
		BatteryData->SOC = 0;
	else if (BatteryData->Voltage < (APP_CUTOFF_VOLTAGE+VOLTAGE_SECURITY_RANGE))
	{
		// Recommended software security: scaling down the SOC if voltage is considered too close to the cutoff voltage. (no accuracy effect) 
		BatteryData->SOC = BatteryData->SOC * (BatteryData->Voltage - APP_CUTOFF_VOLTAGE) / VOLTAGE_SECURITY_RANGE;   
	}

