Hootie81/STC3117/stc3117_Driver.c
	/* Battery charge value calculation */
	BatteryData->ChargeValue = ConfigData->Cnom * BatteryData->SOC / MAX_SOC;

	if ((BatteryData->StatusWord & STC3117_VMODE) == 0) /* mixed mode only*/
	{  
		
		/*Lately fully compensation*/
		if ((BatteryData->StatusWord & STC3117_VMODE) == 0) /*running in mixed mode*/
		{ 
			
			if(BatteryData->Current > APP_EOC_CURRENT && BatteryData->SOC > 990)
			{
				BatteryData->SOC = 990;
				STC3117_WriteWord(STC3117_REG_SOC,50688);   /* 99% */  //force a new SoC displayed by fuel gauge
			}
		}
		
		/*Remaining time calculation*/
		if(BatteryData->Current < 0)
		{
			BatteryData->RemTime = (BatteryData->RemTime * 4 + BatteryData->ChargeValue / BatteryData->Current * 60 ) / 5;
			if( BatteryData->RemTime  < 0)
				BatteryData->RemTime = -1; /* means no estimated time available */
		}
		else
			BatteryData->RemTime = -1; /* means no estimated time available */
		
	}
	else /* voltage mode only */
	{
		BatteryData->Current=0;
		BatteryData->RemTime = -1;
	}
	
	//SOC min/max clamping
	if(BatteryData->SOC>1000) BatteryData->SOC = MAX_SOC;
	if(BatteryData->SOC<0) BatteryData->SOC = 0;

  }
      
  /* save SOC to internal RAM (in case of future Restore process) */
  {
	  RAMData.reg.HRSOC = BatteryData->HRSOC;
	  RAMData.reg.SOC = (BatteryData->SOC+5)/10;
	  STC3117_UpdateRamCRC();
	  STC3117_WriteRamData(RAMData.db);
  }

  if (RAMData.reg.STC3117_State==STC3117_RUNNING)
    return(1);
  else
    return(0);  /* only SOC, OCV and voltage are valid */
}



/*******************************************************************************
* Function Name  : STC3117_SetPowerSavingMode
* Description    : Set the power saving mode
* Input          : None
* Return         : error status (STC3117_OK, !STC3117_OK)
*******************************************************************************/
int STC3117_SetPowerSavingMode(void)
{
  int res;
  
  /* Read the mode register*/
  res = STC3117_ReadByte(STC3117_REG_MODE);

  /* Set the VMODE bit to 1 */
  res = STC3117_WriteByte(STC3117_REG_MODE, (res | STC3117_VMODE));
  if (res!= STC3117_OK) return (res);

   return (STC3117_OK);
}


/*******************************************************************************
* Function Name  : STC3117_StopPowerSavingMode
* Description    : Stop the power saving mode
* Input          : None
* Return         : error status (STC3117_OK, !STC3117_OK)
*******************************************************************************/
int STC3117_StopPowerSavingMode(void)
{
  int res;
  
  /* Read the mode register*/
  res = STC3117_ReadByte(STC3117_REG_MODE);

  /*STC3117 is in power saving mode by default, cannot be set dynamically in mixed mode.		*/
  /*Change stc3117_Driver.h VMODE parameter, and connect an external sense resistor to STC3117	*/
  if (VMODE != MIXED_MODE) return (!STC3117_OK); 
  
  /* Set the VMODE bit to 0 */
  res = STC3117_WriteByte(STC3117_REG_MODE, (res & ~STC3117_VMODE));
  if (res!= STC3117_OK) return (res);

   return (STC3117_OK);
}

/*******************************************************************************
* Function Name  : STC3117_EnableBattDPullup
* Description    : Enable the BattD pullup 
* Input          : None
* Return         : error status (STC3117_OK, !STC3117_OK)
*******************************************************************************/
int STC3117_EnableBattDPullup(void)
{
  int res;
  
  /* Read the mode register*/
  res = STC3117_ReadByte(STC3117_REG_MODE);

  /* Set the BATTD_PU bit to 1 */
  res = STC3117_WriteByte(STC3117_REG_MODE, (res | STC3117_BATTD_PU));
  if (res!= STC3117_OK) return (res);

   return (STC3117_OK);
}


/*******************************************************************************
* Function Name  : STC3117_DisableBattDPullup
* Description    : Disable the BattD pullup
* Input          : None
* Return         : error status (STC3117_OK, !STC3117_OK)
*******************************************************************************/
int STC3117_DisableBattDPullup(void)
{
  int res;
  
  /* Read the mode register*/
  res = STC3117_ReadByte(STC3117_REG_MODE);
  
  /* Set the BattD bit to 0 */
  res = STC3117_WriteByte(STC3117_REG_MODE, (res & ~STC3117_BATTD_PU));
  if (res!= STC3117_OK) return (res);

   return (STC3117_OK);
}

/*******************************************************************************
* Function Name  : STC3117_EnableCharger
* Description    : Set Force CD to 0, Charger will be driven by logic 
* Input          : None
* Return         : error status (STC3117_OK, !STC3117_OK)
*******************************************************************************/
int STC3117_EnableCharger(void)
{
  int res;
  
  /* Read the mode register*/
  res = STC3117_ReadByte(STC3117_REG_MODE);
  
  /* Set the ForceCD bit to 0 */
  res = STC3117_WriteByte(STC3117_REG_MODE, (res & ~STC3117_FORCE_CD));

  if (res!= STC3117_OK) return (res);

   return (STC3117_OK);
}


/*******************************************************************************
* Function Name  : STC3117_DisableCharger
* Description    : Force CD High, disabling the charger
* Input          : None
* Return         : error status (STC3117_OK, !STC3117_OK)
*******************************************************************************/
int STC3117_DisableCharger(void)
{
  int res;
  
  /* Read the mode register*/
  res = STC3117_ReadByte(STC3117_REG_MODE);
  
  /* Set the ForceCD bit to 1 */
  res = STC3117_WriteByte(STC3117_REG_MODE, (res | STC3117_FORCE_CD));
  if (res!= STC3117_OK) return (res);

   return (STC3117_OK);
}

/*******************************************************************************
* Function Name  : STC3117_AlarmSet
* Description    : Set the alarm function
* Input          : None
* Return         : error status (STC3117_OK, !STC3117_OK)
*******************************************************************************/
int STC3117_AlarmSet(void)
{
  int res;

  /* Read the mode register*/
  res = STC3117_ReadByte(STC3117_REG_MODE);

  /* Set the ALM_ENA bit to 1 */
  res = STC3117_WriteByte(STC3117_REG_MODE, (res | STC3117_ALM_ENA));
  if (res!= STC3117_OK) return (res);

  return (STC3117_OK);
}


