Hootie81/STC3117/stc3117_Driver.c
/*******************************************************************************
* Function Name  : STC3117_AlarmStop
* Description    : Stop the alarm function
* Input          : None
* Return         : error status (STC3117_OK, !STC3117_OK)
*******************************************************************************/
int STC3117_AlarmStop(void)
{
  int res;
  
  /* Read the mode register*/
  res = STC3117_ReadByte(STC3117_REG_MODE);

  /* Set the ALM_ENA bit to 0 */
  res = STC3117_WriteByte(STC3117_REG_MODE, (res & ~STC3117_ALM_ENA));
  if (res!= STC3117_OK) return (res);

   return (STC3117_OK);
}


/*******************************************************************************
* Function Name  : STC3117_AlarmGet
* Description    : Return the ALM status
* Input          : None
* Return         : ALM status 00 : no alarm 
*                             01 : SOC alarm
*                             10 : Voltage alarm
*                             11 : SOC and voltage alarm
*******************************************************************************/
int STC3117_AlarmGet(void)
{
  int res;
  
  /* Read the mode register*/
  res = STC3117_ReadByte(STC3117_REG_CTRL);
	if (res== -1) return (res);
	
  res = res >> 5;

   return (res);
}


/*******************************************************************************
* Function Name  : STC3117_AlarmClear
* Description    : Clear the alarm signal
* Input          : None
* Return         : error status (STC3117_OK, !STC3117_OK)
*******************************************************************************/
int STC3117_AlarmClear(void)
{
  int res;
  
  /* clear ALM bits*/
  res = STC3117_WriteByte(STC3117_REG_CTRL, 0x01);
  if (res!= STC3117_OK) return (res);

  return (res);
}


/*******************************************************************************
* Function Name  : STC3117_AlarmSetVoltageThreshold
* Description    : Set the alarm threshold
* Input          : int voltage threshold in mV
* Return         : error status (STC3117_OK, !STC3117_OK)
*******************************************************************************/
int STC3117_AlarmSetVoltageThreshold(STC3117_ConfigData_TypeDef *ConfigData, int VoltThresh)
{
  int res;
  int value;
  
  ConfigData->Alm_Vbat = VoltThresh;
    
  value= ((long)(ConfigData->Alm_Vbat << 9) / VoltageFactor); /* LSB=8*2.2mV */
  res = STC3117_WriteByte(STC3117_REG_ALARM_VOLTAGE, value);
  if (res!= STC3117_OK) return (res);

   return (STC3117_OK);
}


/*******************************************************************************
* Function Name  : STC3117_AlarmSetSOCThreshold
* Description    : Set the alarm threshold
* Input          : int voltage threshold in %
* Return         : error status (STC3117_OK, !STC3117_OK)
*******************************************************************************/
int STC3117_AlarmSetSOCThreshold(STC3117_ConfigData_TypeDef *ConfigData, int SOCThresh)
{
  int res;

  ConfigData->Alm_SOC = SOCThresh;
  res = STC3117_WriteByte(STC3117_REG_ALARM_SOC, ConfigData->Alm_SOC*2);
  if (res!= STC3117_OK) return (res);
  
  return (STC3117_OK);
}

/* ---- End of driver interface functions ------------------------------------------ */

/**** END OF FILE ****/
